[Survived] ObjectLiteral
privacy-guardian/background.js:9:23
 let trackingData = {};
 
 // Load tracker definitions from EasyPrivacy list (simplified version)
-const knownTrackers = {
-  "google-analytics.com": { name: "Google Analytics", category: "Analytics" },
-  "doubleclick.net": { name: "DoubleClick", category: "Advertising" },
-  "facebook.net": { name: "Facebook", category: "Social Media" },
-  "facebook.com": { name: "Facebook", category: "Social Media" },
-  "googlesyndication.com": { name: "Google Ads", category: "Advertising" },
-  "googletagmanager.com": { name: "Google Tag Manager", category: "Analytics" },
-  "hotjar.com": { name: "Hotjar", category: "Analytics" },
-  "amazon-adsystem.com": { name: "Amazon Ads", category: "Advertising" },
-  "scorecardresearch.com": { name: "ScoreCard Research", category: "Analytics" },
-  "twitter.com": { name: "Twitter", category: "Social Media" },
-  "adnxs.com": { name: "AppNexus", category: "Advertising" },
-  "criteo.com": { name: "Criteo", category: "Advertising" },
-  "rubiconproject.com": { name: "Rubicon Project", category: "Advertising" },
-  "optimizely.com": { name: "Optimizely", category: "A/B Testing" },
-  "chartbeat.com": { name: "Chartbeat", category: "Analytics" },
-  "mixpanel.com": { name: "Mixpanel", category: "Analytics" },
-};
+const knownTrackers = {};
 
 // Check if a domain is a known tracker

[Survived] ObjectLiteral
privacy-guardian/background.js:12:19
 const knownTrackers = {
   "google-analytics.com": { name: "Google Analytics", category: "Analytics" },
   "doubleclick.net": { name: "DoubleClick", category: "Advertising" },
-  "facebook.net": { name: "Facebook", category: "Social Media" },
+  "facebook.net": {},
   "facebook.com": { name: "Facebook", category: "Social Media" },
   "googlesyndication.com": { name: "Google Ads", category: "Advertising" },

[Survived] StringLiteral
privacy-guardian/background.js:13:27
   "google-analytics.com": { name: "Google Analytics", category: "Analytics" },
   "doubleclick.net": { name: "DoubleClick", category: "Advertising" },
   "facebook.net": { name: "Facebook", category: "Social Media" },
-  "facebook.com": { name: "Facebook", category: "Social Media" },
+  "facebook.com": { name: "", category: "Social Media" },
   "googlesyndication.com": { name: "Google Ads", category: "Advertising" },
   "googletagmanager.com": { name: "Google Tag Manager", category: "Analytics" },

[Survived] ObjectLiteral
privacy-guardian/background.js:13:19
   "google-analytics.com": { name: "Google Analytics", category: "Analytics" },
   "doubleclick.net": { name: "DoubleClick", category: "Advertising" },
   "facebook.net": { name: "Facebook", category: "Social Media" },
-  "facebook.com": { name: "Facebook", category: "Social Media" },
+  "facebook.com": {},
   "googlesyndication.com": { name: "Google Ads", category: "Advertising" },
   "googletagmanager.com": { name: "Google Tag Manager", category: "Analytics" },

[Survived] ObjectLiteral
privacy-guardian/background.js:14:28
   "doubleclick.net": { name: "DoubleClick", category: "Advertising" },
   "facebook.net": { name: "Facebook", category: "Social Media" },
   "facebook.com": { name: "Facebook", category: "Social Media" },
-  "googlesyndication.com": { name: "Google Ads", category: "Advertising" },
+  "googlesyndication.com": {},
   "googletagmanager.com": { name: "Google Tag Manager", category: "Analytics" },
   "hotjar.com": { name: "Hotjar", category: "Analytics" },

[Survived] StringLiteral
privacy-guardian/background.js:14:60
   "doubleclick.net": { name: "DoubleClick", category: "Advertising" },
   "facebook.net": { name: "Facebook", category: "Social Media" },
   "facebook.com": { name: "Facebook", category: "Social Media" },
-  "googlesyndication.com": { name: "Google Ads", category: "Advertising" },
+  "googlesyndication.com": { name: "Google Ads", category: "" },
   "googletagmanager.com": { name: "Google Tag Manager", category: "Analytics" },
   "hotjar.com": { name: "Hotjar", category: "Analytics" },

[Survived] StringLiteral
privacy-guardian/background.js:15:35
   "facebook.net": { name: "Facebook", category: "Social Media" },
   "facebook.com": { name: "Facebook", category: "Social Media" },
   "googlesyndication.com": { name: "Google Ads", category: "Advertising" },
-  "googletagmanager.com": { name: "Google Tag Manager", category: "Analytics" },
+  "googletagmanager.com": { name: "", category: "Analytics" },
   "hotjar.com": { name: "Hotjar", category: "Analytics" },
   "amazon-adsystem.com": { name: "Amazon Ads", category: "Advertising" },

[Survived] ObjectLiteral
privacy-guardian/background.js:17:26
   "googlesyndication.com": { name: "Google Ads", category: "Advertising" },
   "googletagmanager.com": { name: "Google Tag Manager", category: "Analytics" },
   "hotjar.com": { name: "Hotjar", category: "Analytics" },
-  "amazon-adsystem.com": { name: "Amazon Ads", category: "Advertising" },
+  "amazon-adsystem.com": {},
   "scorecardresearch.com": { name: "ScoreCard Research", category: "Analytics" },
   "twitter.com": { name: "Twitter", category: "Social Media" },

[Survived] StringLiteral
privacy-guardian/background.js:17:34
   "googlesyndication.com": { name: "Google Ads", category: "Advertising" },
   "googletagmanager.com": { name: "Google Tag Manager", category: "Analytics" },
   "hotjar.com": { name: "Hotjar", category: "Analytics" },
-  "amazon-adsystem.com": { name: "Amazon Ads", category: "Advertising" },
+  "amazon-adsystem.com": { name: "", category: "Advertising" },
   "scorecardresearch.com": { name: "ScoreCard Research", category: "Analytics" },
   "twitter.com": { name: "Twitter", category: "Social Media" },

[Survived] StringLiteral
privacy-guardian/background.js:18:36
   "googletagmanager.com": { name: "Google Tag Manager", category: "Analytics" },
   "hotjar.com": { name: "Hotjar", category: "Analytics" },
   "amazon-adsystem.com": { name: "Amazon Ads", category: "Advertising" },
-  "scorecardresearch.com": { name: "ScoreCard Research", category: "Analytics" },
+  "scorecardresearch.com": { name: "", category: "Analytics" },
   "twitter.com": { name: "Twitter", category: "Social Media" },
   "adnxs.com": { name: "AppNexus", category: "Advertising" },

[Survived] ObjectLiteral
privacy-guardian/background.js:18:28
   "googletagmanager.com": { name: "Google Tag Manager", category: "Analytics" },
   "hotjar.com": { name: "Hotjar", category: "Analytics" },
   "amazon-adsystem.com": { name: "Amazon Ads", category: "Advertising" },
-  "scorecardresearch.com": { name: "ScoreCard Research", category: "Analytics" },
+  "scorecardresearch.com": {},
   "twitter.com": { name: "Twitter", category: "Social Media" },
   "adnxs.com": { name: "AppNexus", category: "Advertising" },

[Survived] StringLiteral
privacy-guardian/background.js:19:47
   "hotjar.com": { name: "Hotjar", category: "Analytics" },
   "amazon-adsystem.com": { name: "Amazon Ads", category: "Advertising" },
   "scorecardresearch.com": { name: "ScoreCard Research", category: "Analytics" },
-  "twitter.com": { name: "Twitter", category: "Social Media" },
+  "twitter.com": { name: "Twitter", category: "" },
   "adnxs.com": { name: "AppNexus", category: "Advertising" },
   "criteo.com": { name: "Criteo", category: "Advertising" },

[Survived] StringLiteral
privacy-guardian/background.js:22:62
   "twitter.com": { name: "Twitter", category: "Social Media" },
   "adnxs.com": { name: "AppNexus", category: "Advertising" },
   "criteo.com": { name: "Criteo", category: "Advertising" },
-  "rubiconproject.com": { name: "Rubicon Project", category: "Advertising" },
+  "rubiconproject.com": { name: "Rubicon Project", category: "" },
   "optimizely.com": { name: "Optimizely", category: "A/B Testing" },
   "chartbeat.com": { name: "Chartbeat", category: "Analytics" },

[Survived] StringLiteral
privacy-guardian/background.js:23:29
   "adnxs.com": { name: "AppNexus", category: "Advertising" },
   "criteo.com": { name: "Criteo", category: "Advertising" },
   "rubiconproject.com": { name: "Rubicon Project", category: "Advertising" },
-  "optimizely.com": { name: "Optimizely", category: "A/B Testing" },
+  "optimizely.com": { name: "", category: "A/B Testing" },
   "chartbeat.com": { name: "Chartbeat", category: "Analytics" },
   "mixpanel.com": { name: "Mixpanel", category: "Analytics" },

[Survived] StringLiteral
privacy-guardian/background.js:24:51
   "criteo.com": { name: "Criteo", category: "Advertising" },
   "rubiconproject.com": { name: "Rubicon Project", category: "Advertising" },
   "optimizely.com": { name: "Optimizely", category: "A/B Testing" },
-  "chartbeat.com": { name: "Chartbeat", category: "Analytics" },
+  "chartbeat.com": { name: "Chartbeat", category: "" },
   "mixpanel.com": { name: "Mixpanel", category: "Analytics" },
 };

[Survived] StringLiteral
privacy-guardian/background.js:25:49
   "rubiconproject.com": { name: "Rubicon Project", category: "Advertising" },
   "optimizely.com": { name: "Optimizely", category: "A/B Testing" },
   "chartbeat.com": { name: "Chartbeat", category: "Analytics" },
-  "mixpanel.com": { name: "Mixpanel", category: "Analytics" },
+  "mixpanel.com": { name: "Mixpanel", category: "" },
 };
 

[Survived] StringLiteral
privacy-guardian/background.js:25:27
   "rubiconproject.com": { name: "Rubicon Project", category: "Advertising" },
   "optimizely.com": { name: "Optimizely", category: "A/B Testing" },
   "chartbeat.com": { name: "Chartbeat", category: "Analytics" },
-  "mixpanel.com": { name: "Mixpanel", category: "Analytics" },
+  "mixpanel.com": { name: "", category: "Analytics" },
 };
 

[Survived] BlockStatement
privacy-guardian/background.js:29:33
 };
 
 // Check if a domain is a known tracker
-function isKnownTracker(domain) {
-  if (knownTrackers[domain]) {
-    return knownTrackers[domain];
-  }
-  for (const trackerDomain in knownTrackers) {
-    if (domain.endsWith(`.${trackerDomain}`) || domain === trackerDomain) {
-      return knownTrackers[trackerDomain];
-    }
-  }
-  return null;
-}
+function isKnownTracker(domain) {}
 
 function extractDomain(url) {

[Survived] BlockStatement
privacy-guardian/background.js:30:30
 
 // Check if a domain is a known tracker
 function isKnownTracker(domain) {
-  if (knownTrackers[domain]) {
-    return knownTrackers[domain];
-  }
+  if (knownTrackers[domain]) {}
   for (const trackerDomain in knownTrackers) {
     if (domain.endsWith(`.${trackerDomain}`) || domain === trackerDomain) {

[Survived] ConditionalExpression
privacy-guardian/background.js:30:7
 
 // Check if a domain is a known tracker
 function isKnownTracker(domain) {
-  if (knownTrackers[domain]) {
+  if (true) {
     return knownTrackers[domain];
   }

[Survived] BlockStatement
privacy-guardian/background.js:33:46
   if (knownTrackers[domain]) {
     return knownTrackers[domain];
   }
-  for (const trackerDomain in knownTrackers) {
-    if (domain.endsWith(`.${trackerDomain}`) || domain === trackerDomain) {
-      return knownTrackers[trackerDomain];
-    }
-  }
+  for (const trackerDomain in knownTrackers) {}
   return null;
 }

[Survived] BlockStatement
privacy-guardian/background.js:34:75
     return knownTrackers[domain];
   }
   for (const trackerDomain in knownTrackers) {
-    if (domain.endsWith(`.${trackerDomain}`) || domain === trackerDomain) {
-      return knownTrackers[trackerDomain];
-    }
+    if (domain.endsWith(`.${trackerDomain}`) || domain === trackerDomain) {}
   }
   return null;

[Survived] LogicalOperator
privacy-guardian/background.js:34:9
     return knownTrackers[domain];
   }
   for (const trackerDomain in knownTrackers) {
-    if (domain.endsWith(`.${trackerDomain}`) || domain === trackerDomain) {
+    if (domain.endsWith(`.${trackerDomain}`) && domain === trackerDomain) {
       return knownTrackers[trackerDomain];
     }

[Survived] BlockStatement
privacy-guardian/background.js:41:29
   return null;
 }
 
-function extractDomain(url) {
-  try {
-    return new URL(url).hostname;
-  } catch {
-    return '';
-  }
-}
+function extractDomain(url) {}
 
 function isThirdParty(details) {

[Survived] BlockStatement
privacy-guardian/background.js:42:7
 }
 
 function extractDomain(url) {
-  try {
-    return new URL(url).hostname;
-  } catch {
+  try {} catch {
     return '';
   }

[Survived] BlockStatement
privacy-guardian/background.js:44:11
 function extractDomain(url) {
   try {
     return new URL(url).hostname;
-  } catch {
-    return '';
-  }
+  } catch {}
 }
 

[Survived] BlockStatement
privacy-guardian/background.js:49:32
   }
 }
 
-function isThirdParty(details) {
-  // Simple third-party check
-  if (!details.initiator) return true;
-  const reqDomain = extractDomain(details.url);
-  const initiatorDomain = extractDomain(details.initiator);
-  return reqDomain !== initiatorDomain;
-}
+function isThirdParty(details) {}
 
 // Privacy Score Calculation

[Survived] BooleanLiteral
privacy-guardian/background.js:51:34
 
 function isThirdParty(details) {
   // Simple third-party check
-  if (!details.initiator) return true;
+  if (!details.initiator) return false;
   const reqDomain = extractDomain(details.url);
   const initiatorDomain = extractDomain(details.initiator);

[Survived] ConditionalExpression
privacy-guardian/background.js:51:7
 
 function isThirdParty(details) {
   // Simple third-party check
-  if (!details.initiator) return true;
+  if (false) return true;
   const reqDomain = extractDomain(details.url);
   const initiatorDomain = extractDomain(details.initiator);

[Survived] ConditionalExpression
privacy-guardian/background.js:54:10
   if (!details.initiator) return true;
   const reqDomain = extractDomain(details.url);
   const initiatorDomain = extractDomain(details.initiator);
-  return reqDomain !== initiatorDomain;
+  return true;
 }
 

[Survived] ConditionalExpression
privacy-guardian/background.js:54:10
   if (!details.initiator) return true;
   const reqDomain = extractDomain(details.url);
   const initiatorDomain = extractDomain(details.initiator);
-  return reqDomain !== initiatorDomain;
+  return false;
 }
 

[Survived] BlockStatement
privacy-guardian/background.js:58:42
 }
 
 // Privacy Score Calculation
-function calculatePrivacyScore(trackers) {
-  let score = 100;
-  Object.values(trackers).forEach(tracker => {
-    switch (tracker.category) {
-      case 'Advertising': score -= 3; break;
-      case 'Analytics': score -= 2; break;
-      case 'Fingerprinting': score -= 4; break;
-      default: score -= 1; break;
-    }
-  });
-  return Math.max(score, 0);
-}
+function calculatePrivacyScore(trackers) {}
 
 // Update global tracker history for dashboard

[Survived] BlockStatement
privacy-guardian/background.js:60:46
 // Privacy Score Calculation
 function calculatePrivacyScore(trackers) {
   let score = 100;
-  Object.values(trackers).forEach(tracker => {
-    switch (tracker.category) {
-      case 'Advertising': score -= 3; break;
-      case 'Analytics': score -= 2; break;
-      case 'Fingerprinting': score -= 4; break;
-      default: score -= 1; break;
-    }
-  });
+  Object.values(trackers).forEach(tracker => {});
   return Math.max(score, 0);
 }

[Survived] AssignmentOperator
privacy-guardian/background.js:62:27
   let score = 100;
   Object.values(trackers).forEach(tracker => {
     switch (tracker.category) {
-      case 'Advertising': score -= 3; break;
+      case 'Advertising': score += 3; break;
       case 'Analytics': score -= 2; break;
       case 'Fingerprinting': score -= 4; break;

[Survived] ConditionalExpression
privacy-guardian/background.js:62:7
   let score = 100;
   Object.values(trackers).forEach(tracker => {
     switch (tracker.category) {
-      case 'Advertising': score -= 3; break;
+      case 'Advertising':
       case 'Analytics': score -= 2; break;
       case 'Fingerprinting': score -= 4; break;

[Survived] ConditionalExpression
privacy-guardian/background.js:63:7
   Object.values(trackers).forEach(tracker => {
     switch (tracker.category) {
       case 'Advertising': score -= 3; break;
-      case 'Analytics': score -= 2; break;
+      case 'Analytics':
       case 'Fingerprinting': score -= 4; break;
       default: score -= 1; break;

[Survived] AssignmentOperator
privacy-guardian/background.js:63:25
   Object.values(trackers).forEach(tracker => {
     switch (tracker.category) {
       case 'Advertising': score -= 3; break;
-      case 'Analytics': score -= 2; break;
+      case 'Analytics': score += 2; break;
       case 'Fingerprinting': score -= 4; break;
       default: score -= 1; break;

[Survived] AssignmentOperator
privacy-guardian/background.js:64:30
     switch (tracker.category) {
       case 'Advertising': score -= 3; break;
       case 'Analytics': score -= 2; break;
-      case 'Fingerprinting': score -= 4; break;
+      case 'Fingerprinting': score += 4; break;
       default: score -= 1; break;
     }

[Survived] ConditionalExpression
privacy-guardian/background.js:64:7
     switch (tracker.category) {
       case 'Advertising': score -= 3; break;
       case 'Analytics': score -= 2; break;
-      case 'Fingerprinting': score -= 4; break;
+      case 'Fingerprinting':
       default: score -= 1; break;
     }

[Survived] ConditionalExpression
privacy-guardian/background.js:65:7
       case 'Advertising': score -= 3; break;
       case 'Analytics': score -= 2; break;
       case 'Fingerprinting': score -= 4; break;
-      default: score -= 1; break;
+      default:
     }
   });

[Survived] AssignmentOperator
privacy-guardian/background.js:65:16
       case 'Advertising': score -= 3; break;
       case 'Analytics': score -= 2; break;
       case 'Fingerprinting': score -= 4; break;
-      default: score -= 1; break;
+      default: score += 1; break;
     }
   });

[Survived] BlockStatement
privacy-guardian/background.js:72:38
 }
 
 // Update global tracker history for dashboard
-function updateTrackerHistory(tabId) {
-  if (!trackingData[tabId] || !trackingData[tabId].pageDomain) return;
-  const domain = trackingData[tabId].pageDomain;
-  const trackers = trackingData[tabId].trackers;
-  const privacyScore = calculatePrivacyScore(trackers);
-  const timestamp = Date.now();
-  const blocked = false; // Not implemented
-  chrome.storage.local.get('trackerHistory', data => {
-    const history = data.trackerHistory || {};
-    if (!history[domain]) history[domain] = [];
-    history[domain].unshift({
-      privacyScore,
-      blocked,
-      trackers,
-      timestamp
-    });
-    // Keep only last 10 visits per domain
-    history[domain] = history[domain].slice(0, 10);
-    chrome.storage.local.set({ trackerHistory: history });
-  });
-}
+function updateTrackerHistory(tabId) {}
 
 // Process a web request

[Survived] BooleanLiteral
privacy-guardian/background.js:73:31
 
 // Update global tracker history for dashboard
 function updateTrackerHistory(tabId) {
-  if (!trackingData[tabId] || !trackingData[tabId].pageDomain) return;
+  if (!trackingData[tabId] || trackingData[tabId].pageDomain) return;
   const domain = trackingData[tabId].pageDomain;
   const trackers = trackingData[tabId].trackers;

[Survived] ConditionalExpression
privacy-guardian/background.js:73:7
 
 // Update global tracker history for dashboard
 function updateTrackerHistory(tabId) {
-  if (!trackingData[tabId] || !trackingData[tabId].pageDomain) return;
+  if (true) return;
   const domain = trackingData[tabId].pageDomain;
   const trackers = trackingData[tabId].trackers;

[Survived] BooleanLiteral
privacy-guardian/background.js:78:19
   const trackers = trackingData[tabId].trackers;
   const privacyScore = calculatePrivacyScore(trackers);
   const timestamp = Date.now();
-  const blocked = false; // Not implemented
+  const blocked = true; // Not implemented
   chrome.storage.local.get('trackerHistory', data => {
     const history = data.trackerHistory || {};

[Survived] BlockStatement
privacy-guardian/background.js:79:54
   const privacyScore = calculatePrivacyScore(trackers);
   const timestamp = Date.now();
   const blocked = false; // Not implemented
-  chrome.storage.local.get('trackerHistory', data => {
-    const history = data.trackerHistory || {};
-    if (!history[domain]) history[domain] = [];
-    history[domain].unshift({
-      privacyScore,
-      blocked,
-      trackers,
-      timestamp
-    });
-    // Keep only last 10 visits per domain
-    history[domain] = history[domain].slice(0, 10);
-    chrome.storage.local.set({ trackerHistory: history });
-  });
+  chrome.storage.local.get('trackerHistory', data => {});
 }
 

[Survived] LogicalOperator
privacy-guardian/background.js:80:21
   const timestamp = Date.now();
   const blocked = false; // Not implemented
   chrome.storage.local.get('trackerHistory', data => {
-    const history = data.trackerHistory || {};
+    const history = data.trackerHistory && {};
     if (!history[domain]) history[domain] = [];
     history[domain].unshift({

[Survived] ConditionalExpression
privacy-guardian/background.js:80:21
   const timestamp = Date.now();
   const blocked = false; // Not implemented
   chrome.storage.local.get('trackerHistory', data => {
-    const history = data.trackerHistory || {};
+    const history = true;
     if (!history[domain]) history[domain] = [];
     history[domain].unshift({

[Survived] BooleanLiteral
privacy-guardian/background.js:81:9
   const blocked = false; // Not implemented
   chrome.storage.local.get('trackerHistory', data => {
     const history = data.trackerHistory || {};
-    if (!history[domain]) history[domain] = [];
+    if (history[domain]) history[domain] = [];
     history[domain].unshift({
       privacyScore,

[Survived] ConditionalExpression
privacy-guardian/background.js:81:9
   const blocked = false; // Not implemented
   chrome.storage.local.get('trackerHistory', data => {
     const history = data.trackerHistory || {};
-    if (!history[domain]) history[domain] = [];
+    if (false) history[domain] = [];
     history[domain].unshift({
       privacyScore,

[Survived] ObjectLiteral
privacy-guardian/background.js:82:29
   chrome.storage.local.get('trackerHistory', data => {
     const history = data.trackerHistory || {};
     if (!history[domain]) history[domain] = [];
-    history[domain].unshift({
-      privacyScore,
-      blocked,
-      trackers,
-      timestamp
-    });
+    history[domain].unshift({});
     // Keep only last 10 visits per domain
     history[domain] = history[domain].slice(0, 10);

[Survived] MethodExpression
privacy-guardian/background.js:89:23
       timestamp
     });
     // Keep only last 10 visits per domain
-    history[domain] = history[domain].slice(0, 10);
+    history[domain] = history[domain];
     chrome.storage.local.set({ trackerHistory: history });
   });

[Survived] ConditionalExpression
privacy-guardian/background.js:96:7
 
 // Process a web request
 function processRequest(details) {
-  if (!isThirdParty(details)) return;
+  if (false) return;
   const tabId = details.tabId;
   const targetDomain = extractDomain(details.url);

[Survived] ConditionalExpression
privacy-guardian/background.js:96:7
 
 // Process a web request
 function processRequest(details) {
-  if (!isThirdParty(details)) return;
+  if (true) return;
   const tabId = details.tabId;
   const targetDomain = extractDomain(details.url);

[Survived] ConditionalExpression
privacy-guardian/background.js:100:7
   const tabId = details.tabId;
   const targetDomain = extractDomain(details.url);
   const trackerInfo = isKnownTracker(targetDomain);
-  if (!trackerInfo || tabId < 0) return;
+  if (false) return;
   if (!trackingData[tabId]) {
     trackingData[tabId] = {

[Survived] ConditionalExpression
privacy-guardian/background.js:100:7
   const tabId = details.tabId;
   const targetDomain = extractDomain(details.url);
   const trackerInfo = isKnownTracker(targetDomain);
-  if (!trackerInfo || tabId < 0) return;
+  if (true) return;
   if (!trackingData[tabId]) {
     trackingData[tabId] = {

[Survived] ConditionalExpression
privacy-guardian/background.js:101:7
   const targetDomain = extractDomain(details.url);
   const trackerInfo = isKnownTracker(targetDomain);
   if (!trackerInfo || tabId < 0) return;
-  if (!trackingData[tabId]) {
+  if (true) {
     trackingData[tabId] = {
       pageUrl: null,

[Survived] ConditionalExpression
privacy-guardian/background.js:101:7
   const targetDomain = extractDomain(details.url);
   const trackerInfo = isKnownTracker(targetDomain);
   if (!trackerInfo || tabId < 0) return;
-  if (!trackingData[tabId]) {
+  if (false) {
     trackingData[tabId] = {
       pageUrl: null,

[Survived] BlockStatement
privacy-guardian/background.js:108:52
       trackers: {}
     };
   }
-  if (!trackingData[tabId].trackers[targetDomain]) {
-    trackingData[tabId].trackers[targetDomain] = {
-      name: trackerInfo.name,
-      category: trackerInfo.category,
-      count: 0,
-      urls: []
-    };
-  }
+  if (!trackingData[tabId].trackers[targetDomain]) {}
   trackingData[tabId].trackers[targetDomain].count++;
   if (!trackingData[tabId].trackers[targetDomain].urls.includes(details.url) && trackingData[tabId].trackers[targetDomain].urls.length < 5) {

[Survived] BooleanLiteral
privacy-guardian/background.js:108:7
       trackers: {}
     };
   }
-  if (!trackingData[tabId].trackers[targetDomain]) {
+  if (trackingData[tabId].trackers[targetDomain]) {
     trackingData[tabId].trackers[targetDomain] = {
       name: trackerInfo.name,

[Survived] ObjectLiteral
privacy-guardian/background.js:109:50
     };
   }
   if (!trackingData[tabId].trackers[targetDomain]) {
-    trackingData[tabId].trackers[targetDomain] = {
-      name: trackerInfo.name,
-      category: trackerInfo.category,
-      count: 0,
-      urls: []
-    };
+    trackingData[tabId].trackers[targetDomain] = {};
   }
   trackingData[tabId].trackers[targetDomain].count++;

[Survived] ArrayDeclaration
privacy-guardian/background.js:113:13
       name: trackerInfo.name,
       category: trackerInfo.category,
       count: 0,
-      urls: []
+      urls: ["Stryker was here"]
     };
   }

[Survived] UpdateOperator
privacy-guardian/background.js:116:3
       urls: []
     };
   }
-  trackingData[tabId].trackers[targetDomain].count++;
+  trackingData[tabId].trackers[targetDomain].count--;
   if (!trackingData[tabId].trackers[targetDomain].urls.includes(details.url) && trackingData[tabId].trackers[targetDomain].urls.length < 5) {
     trackingData[tabId].trackers[targetDomain].urls.push(details.url);

[Survived] EqualityOperator
privacy-guardian/background.js:117:81
     };
   }
   trackingData[tabId].trackers[targetDomain].count++;
-  if (!trackingData[tabId].trackers[targetDomain].urls.includes(details.url) && trackingData[tabId].trackers[targetDomain].urls.length < 5) {
+  if (!trackingData[tabId].trackers[targetDomain].urls.includes(details.url) && trackingData[tabId].trackers[targetDomain].urls.length <= 5) {
     trackingData[tabId].trackers[targetDomain].urls.push(details.url);
   }

[Survived] BooleanLiteral
privacy-guardian/background.js:117:7
     };
   }
   trackingData[tabId].trackers[targetDomain].count++;
-  if (!trackingData[tabId].trackers[targetDomain].urls.includes(details.url) && trackingData[tabId].trackers[targetDomain].urls.length < 5) {
+  if (trackingData[tabId].trackers[targetDomain].urls.includes(details.url) && trackingData[tabId].trackers[targetDomain].urls.length < 5) {
     trackingData[tabId].trackers[targetDomain].urls.push(details.url);
   }

[Survived] BlockStatement
privacy-guardian/background.js:125:51
   updateTrackerHistory(tabId);
 }
 
-function updateTrackerCount(tabId, trackerDomain) {
-  if (tabId < 0) return;
-  if (!trackerCounts[tabId]) {
-    trackerCounts[tabId] = new Set();
-  }
-  trackerCounts[tabId].add(trackerDomain);
-  const count = trackerCounts[tabId].size;
-  updateBadge(tabId, count);
-}
+function updateTrackerCount(tabId, trackerDomain) {}
 
 function updateBadge(tabId, count) {

[Survived] EqualityOperator
privacy-guardian/background.js:126:7
 }
 
 function updateTrackerCount(tabId, trackerDomain) {
-  if (tabId < 0) return;
+  if (tabId <= 0) return;
   if (!trackerCounts[tabId]) {
     trackerCounts[tabId] = new Set();

[Survived] ConditionalExpression
privacy-guardian/background.js:126:7
 }
 
 function updateTrackerCount(tabId, trackerDomain) {
-  if (tabId < 0) return;
+  if (true) return;
   if (!trackerCounts[tabId]) {
     trackerCounts[tabId] = new Set();

[Survived] ConditionalExpression
privacy-guardian/background.js:127:7
 
 function updateTrackerCount(tabId, trackerDomain) {
   if (tabId < 0) return;
-  if (!trackerCounts[tabId]) {
+  if (false) {
     trackerCounts[tabId] = new Set();
   }

[Survived] BooleanLiteral
privacy-guardian/background.js:127:7
 
 function updateTrackerCount(tabId, trackerDomain) {
   if (tabId < 0) return;
-  if (!trackerCounts[tabId]) {
+  if (trackerCounts[tabId]) {
     trackerCounts[tabId] = new Set();
   }

[Survived] BlockStatement
privacy-guardian/background.js:135:36
   updateBadge(tabId, count);
 }
 
-function updateBadge(tabId, count) {
-  if (tabId < 0) {
-    return;
-  }
-  const trackerCount = count !== undefined ? count : (trackingData[tabId] ? Object.keys(trackingData[tabId].trackers).length : 0);
-  chrome.action.setBadgeText({ text: trackerCount > 0 ? trackerCount.toString() : '', tabId: tabId });
-  chrome.action.setBadgeBackgroundColor({ color: trackerCount > 10 ? '#E53935' : trackerCount > 5 ? '#FB8C00' : '#43A047', tabId: tabId });
-}
+function updateBadge(tabId, count) {}
 
 function saveTrackingData(tabId) {
