[Survived] BlockStatement
privacy-guardian/background.js:136:18
 }
 
 function updateBadge(tabId, count) {
-  if (tabId < 0) {
-    return;
-  }
+  if (tabId < 0) {}
   const trackerCount = count !== undefined ? count : (trackingData[tabId] ? Object.keys(trackingData[tabId].trackers).length : 0);
   chrome.action.setBadgeText({ text: trackerCount > 0 ? trackerCount.toString() : '', tabId: tabId });

[Survived] EqualityOperator
privacy-guardian/background.js:136:7
 }
 
 function updateBadge(tabId, count) {
-  if (tabId < 0) {
+  if (tabId <= 0) {
     return;
   }

[Survived] EqualityOperator
privacy-guardian/background.js:139:24
   if (tabId < 0) {
     return;
   }
-  const trackerCount = count !== undefined ? count : (trackingData[tabId] ? Object.keys(trackingData[tabId].trackers).length : 0);
+  const trackerCount = count === undefined ? count : (trackingData[tabId] ? Object.keys(trackingData[tabId].trackers).length : 0);
   chrome.action.setBadgeText({ text: trackerCount > 0 ? trackerCount.toString() : '', tabId: tabId });
   chrome.action.setBadgeBackgroundColor({ color: trackerCount > 10 ? '#E53935' : trackerCount > 5 ? '#FB8C00' : '#43A047', tabId: tabId });

[Survived] ConditionalExpression
privacy-guardian/background.js:139:24
   if (tabId < 0) {
     return;
   }
-  const trackerCount = count !== undefined ? count : (trackingData[tabId] ? Object.keys(trackingData[tabId].trackers).length : 0);
+  const trackerCount = true ? count : (trackingData[tabId] ? Object.keys(trackingData[tabId].trackers).length : 0);
   chrome.action.setBadgeText({ text: trackerCount > 0 ? trackerCount.toString() : '', tabId: tabId });
   chrome.action.setBadgeBackgroundColor({ color: trackerCount > 10 ? '#E53935' : trackerCount > 5 ? '#FB8C00' : '#43A047', tabId: tabId });

[Survived] EqualityOperator
privacy-guardian/background.js:140:38
     return;
   }
   const trackerCount = count !== undefined ? count : (trackingData[tabId] ? Object.keys(trackingData[tabId].trackers).length : 0);
-  chrome.action.setBadgeText({ text: trackerCount > 0 ? trackerCount.toString() : '', tabId: tabId });
+  chrome.action.setBadgeText({ text: trackerCount >= 0 ? trackerCount.toString() : '', tabId: tabId });
   chrome.action.setBadgeBackgroundColor({ color: trackerCount > 10 ? '#E53935' : trackerCount > 5 ? '#FB8C00' : '#43A047', tabId: tabId });
 }

[Survived] ConditionalExpression
privacy-guardian/background.js:140:38
     return;
   }
   const trackerCount = count !== undefined ? count : (trackingData[tabId] ? Object.keys(trackingData[tabId].trackers).length : 0);
-  chrome.action.setBadgeText({ text: trackerCount > 0 ? trackerCount.toString() : '', tabId: tabId });
+  chrome.action.setBadgeText({ text: true ? trackerCount.toString() : '', tabId: tabId });
   chrome.action.setBadgeBackgroundColor({ color: trackerCount > 10 ? '#E53935' : trackerCount > 5 ? '#FB8C00' : '#43A047', tabId: tabId });
 }

[Survived] ConditionalExpression
privacy-guardian/background.js:141:82
   }
   const trackerCount = count !== undefined ? count : (trackingData[tabId] ? Object.keys(trackingData[tabId].trackers).length : 0);
   chrome.action.setBadgeText({ text: trackerCount > 0 ? trackerCount.toString() : '', tabId: tabId });
-  chrome.action.setBadgeBackgroundColor({ color: trackerCount > 10 ? '#E53935' : trackerCount > 5 ? '#FB8C00' : '#43A047', tabId: tabId });
+  chrome.action.setBadgeBackgroundColor({ color: trackerCount > 10 ? '#E53935' : false ? '#FB8C00' : '#43A047', tabId: tabId });
 }
 

[Survived] EqualityOperator
privacy-guardian/background.js:141:50
   }
   const trackerCount = count !== undefined ? count : (trackingData[tabId] ? Object.keys(trackingData[tabId].trackers).length : 0);
   chrome.action.setBadgeText({ text: trackerCount > 0 ? trackerCount.toString() : '', tabId: tabId });
-  chrome.action.setBadgeBackgroundColor({ color: trackerCount > 10 ? '#E53935' : trackerCount > 5 ? '#FB8C00' : '#43A047', tabId: tabId });
+  chrome.action.setBadgeBackgroundColor({ color: trackerCount <= 10 ? '#E53935' : trackerCount > 5 ? '#FB8C00' : '#43A047', tabId: tabId });
 }
 

[Survived] BlockStatement
privacy-guardian/background.js:144:34
   chrome.action.setBadgeBackgroundColor({ color: trackerCount > 10 ? '#E53935' : trackerCount > 5 ? '#FB8C00' : '#43A047', tabId: tabId });
 }
 
-function saveTrackingData(tabId) {
-  if (!trackingData[tabId]) return;
-  chrome.storage.local.set({ [`tab_${tabId}`]: trackingData[tabId] });
-}
+function saveTrackingData(tabId) {}
 
 function handleTabUpdate(tabId, changeInfo, tab) {

[Survived] ConditionalExpression
privacy-guardian/background.js:145:7
 }
 
 function saveTrackingData(tabId) {
-  if (!trackingData[tabId]) return;
+  if (true) return;
   chrome.storage.local.set({ [`tab_${tabId}`]: trackingData[tabId] });
 }

[Survived] ConditionalExpression
privacy-guardian/background.js:145:7
 }
 
 function saveTrackingData(tabId) {
-  if (!trackingData[tabId]) return;
+  if (false) return;
   chrome.storage.local.set({ [`tab_${tabId}`]: trackingData[tabId] });
 }

[Survived] BlockStatement
privacy-guardian/background.js:149:50
   chrome.storage.local.set({ [`tab_${tabId}`]: trackingData[tabId] });
 }
 
-function handleTabUpdate(tabId, changeInfo, tab) {
-  if (changeInfo.status === 'loading' && tab.url) {
-    const pageDomain = extractDomain(tab.url);
-    trackingData[tabId] = {
-      pageUrl: tab.url,
-      pageDomain: pageDomain,
-      trackers: {}
-    };
-    chrome.action.setBadgeText({ text: '', tabId: tabId });
-    saveTrackingData(tabId);
-  }
-}
+function handleTabUpdate(tabId, changeInfo, tab) {}
 
 function handleTabRemove(tabId) {

[Survived] BlockStatement
privacy-guardian/background.js:150:51
 }
 
 function handleTabUpdate(tabId, changeInfo, tab) {
-  if (changeInfo.status === 'loading' && tab.url) {
-    const pageDomain = extractDomain(tab.url);
-    trackingData[tabId] = {
-      pageUrl: tab.url,
-      pageDomain: pageDomain,
-      trackers: {}
-    };
-    chrome.action.setBadgeText({ text: '', tabId: tabId });
-    saveTrackingData(tabId);
-  }
+  if (changeInfo.status === 'loading' && tab.url) {}
 }
 

[Survived] ConditionalExpression
privacy-guardian/background.js:150:7
 }
 
 function handleTabUpdate(tabId, changeInfo, tab) {
-  if (changeInfo.status === 'loading' && tab.url) {
+  if (true) {
     const pageDomain = extractDomain(tab.url);
     trackingData[tabId] = {

[Survived] ObjectLiteral
privacy-guardian/background.js:152:27
 function handleTabUpdate(tabId, changeInfo, tab) {
   if (changeInfo.status === 'loading' && tab.url) {
     const pageDomain = extractDomain(tab.url);
-    trackingData[tabId] = {
-      pageUrl: tab.url,
-      pageDomain: pageDomain,
-      trackers: {}
-    };
+    trackingData[tabId] = {};
     chrome.action.setBadgeText({ text: '', tabId: tabId });
     saveTrackingData(tabId);

[Survived] StringLiteral
privacy-guardian/background.js:157:40
       pageDomain: pageDomain,
       trackers: {}
     };
-    chrome.action.setBadgeText({ text: '', tabId: tabId });
+    chrome.action.setBadgeText({ text: "Stryker was here!", tabId: tabId });
     saveTrackingData(tabId);
   }

[Survived] BlockStatement
privacy-guardian/background.js:162:33
   }
 }
 
-function handleTabRemove(tabId) {
-  delete trackingData[tabId];
-  delete trackerCounts[tabId];
-}
+function handleTabRemove(tabId) {}
 
 chrome.webRequest.onBeforeRequest.addListener(

[Survived] ArrayDeclaration
privacy-guardian/background.js:169:11
 
 chrome.webRequest.onBeforeRequest.addListener(
   processRequest,
-  { urls: ["<all_urls>"] }
+  { urls: [] }
 );
 

[Survived] BlockStatement
privacy-guardian/background.js:175:73
 chrome.tabs.onUpdated.addListener(handleTabUpdate);
 chrome.tabs.onRemoved.addListener(handleTabRemove);
 
-chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
-  if (message.action === 'getTrackingData') {
-    const tabId = message.tabId;
-    if (trackingData[tabId]) {
-      sendResponse(trackingData[tabId]);
-    } else {
-      chrome.storage.local.get([`tab_${tabId}`], (result) => {
-        sendResponse(result[`tab_${tabId}`] || { trackers: {} });
-      });
-      return true;
-    }
-  }
-  if (message.action === 'toggleBlocker') {
-    sendResponse({ success: true });
-  }
-});
+chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {});
 

[Survived] ConditionalExpression
privacy-guardian/background.js:176:7
 chrome.tabs.onRemoved.addListener(handleTabRemove);
 
 chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
-  if (message.action === 'getTrackingData') {
+  if (false) {
     const tabId = message.tabId;
     if (trackingData[tabId]) {

[Survived] ConditionalExpression
privacy-guardian/background.js:176:7
 chrome.tabs.onRemoved.addListener(handleTabRemove);
 
 chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
-  if (message.action === 'getTrackingData') {
+  if (true) {
     const tabId = message.tabId;
     if (trackingData[tabId]) {

[Survived] BlockStatement
privacy-guardian/background.js:178:30
 chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
   if (message.action === 'getTrackingData') {
     const tabId = message.tabId;
-    if (trackingData[tabId]) {
-      sendResponse(trackingData[tabId]);
-    } else {
+    if (trackingData[tabId]) {} else {
       chrome.storage.local.get([`tab_${tabId}`], (result) => {
         sendResponse(result[`tab_${tabId}`] || { trackers: {} });

[Survived] ConditionalExpression
privacy-guardian/background.js:178:9
 chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
   if (message.action === 'getTrackingData') {
     const tabId = message.tabId;
-    if (trackingData[tabId]) {
+    if (true) {
       sendResponse(trackingData[tabId]);
     } else {

[Survived] BlockStatement
privacy-guardian/background.js:180:12
     const tabId = message.tabId;
     if (trackingData[tabId]) {
       sendResponse(trackingData[tabId]);
-    } else {
-      chrome.storage.local.get([`tab_${tabId}`], (result) => {
-        sendResponse(result[`tab_${tabId}`] || { trackers: {} });
-      });
-      return true;
-    }
+    } else {}
   }
   if (message.action === 'toggleBlocker') {

[Survived] BlockStatement
privacy-guardian/background.js:181:62
     if (trackingData[tabId]) {
       sendResponse(trackingData[tabId]);
     } else {
-      chrome.storage.local.get([`tab_${tabId}`], (result) => {
-        sendResponse(result[`tab_${tabId}`] || { trackers: {} });
-      });
+      chrome.storage.local.get([`tab_${tabId}`], (result) => {});
       return true;
     }

[Survived] LogicalOperator
privacy-guardian/background.js:182:22
       sendResponse(trackingData[tabId]);
     } else {
       chrome.storage.local.get([`tab_${tabId}`], (result) => {
-        sendResponse(result[`tab_${tabId}`] || { trackers: {} });
+        sendResponse(result[`tab_${tabId}`] && {
+  trackers: {}
+});
       });
       return true;

[Survived] ConditionalExpression
privacy-guardian/background.js:182:22
       sendResponse(trackingData[tabId]);
     } else {
       chrome.storage.local.get([`tab_${tabId}`], (result) => {
-        sendResponse(result[`tab_${tabId}`] || { trackers: {} });
+        sendResponse(false);
       });
       return true;

[Survived] BlockStatement
privacy-guardian/background.js:187:43
       return true;
     }
   }
-  if (message.action === 'toggleBlocker') {
-    sendResponse({ success: true });
-  }
+  if (message.action === 'toggleBlocker') {}
 });
 

[Survived] EqualityOperator
privacy-guardian/background.js:187:7
       return true;
     }
   }
-  if (message.action === 'toggleBlocker') {
+  if (message.action !== 'toggleBlocker') {
     sendResponse({ success: true });
   }

[Survived] BooleanLiteral
privacy-guardian/background.js:188:29
     }
   }
   if (message.action === 'toggleBlocker') {
-    sendResponse({ success: true });
+    sendResponse({ success: false });
   }
 });

[Survived] ObjectLiteral
privacy-guardian/background.js:188:18
     }
   }
   if (message.action === 'toggleBlocker') {
-    sendResponse({ success: true });
+    sendResponse({});
   }
 });
