[Survived] BlockStatement
privacy-guardian/content.js:11:73
 // It can be expanded later to handle more complex interactions
 
 // Listen for messages from the popup or background script
-chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
-  console.log(`Privacy Guardian: Content script received message:`, message);
-  
-  if (message.action === 'getPageInfo') {
-    // Send page information back to the requester
-    const response = {
-      url: window.location.href,
-      domain: window.location.hostname,
-      title: document.title
-    };
-    
-    console.log(`Privacy Guardian: Sending page info:`, response);
-    sendResponse(response);
-  }
-  
-  return true; // Required for async response
-});
+chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {});

[Survived] BlockStatement
privacy-guardian/content.js:14:41
 chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
   console.log(`Privacy Guardian: Content script received message:`, message);
   
-  if (message.action === 'getPageInfo') {
-    // Send page information back to the requester
-    const response = {
-      url: window.location.href,
-      domain: window.location.hostname,
-      title: document.title
-    };
-    
-    console.log(`Privacy Guardian: Sending page info:`, response);
-    sendResponse(response);
-  }
+  if (message.action === 'getPageInfo') {}
   
   return true; // Required for async response

[Survived] ConditionalExpression
privacy-guardian/content.js:14:7
 chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
   console.log(`Privacy Guardian: Content script received message:`, message);
   
-  if (message.action === 'getPageInfo') {
+  if (false) {
     // Send page information back to the requester
     const response = {

[Survived] StringLiteral
privacy-guardian/content.js:22:17
       title: document.title
     };
     
-    console.log(`Privacy Guardian: Sending page info:`, response);
+    console.log(``, response);
     sendResponse(response);
   }

[Survived] BooleanLiteral
privacy-guardian/content.js:26:10
     sendResponse(response);
   }
   
-  return true; // Required for async response
+  return false; // Required for async response
 });
