[Survived] BlockStatement
privacy-guardian/dashboard-logic.js:2:49
 // Calculate privacy score based on trackers
-export function calculatePrivacyScore(trackers) {
-    let score = 100;
-    trackers.forEach(tracker => {
-      score -= tracker.getScore();
-    });
-    return Math.max(score, 0);
-  }
+export function calculatePrivacyScore(trackers) {}
   
   // Summarize visits to get array of privacy scores

[Survived] BlockStatement
privacy-guardian/dashboard-logic.js:4:33
 // Calculate privacy score based on trackers
 export function calculatePrivacyScore(trackers) {
     let score = 100;
-    trackers.forEach(tracker => {
-      score -= tracker.getScore();
-    });
+    trackers.forEach(tracker => {});
     return Math.max(score, 0);
   }

[Survived] AssignmentOperator
privacy-guardian/dashboard-logic.js:5:7
 export function calculatePrivacyScore(trackers) {
     let score = 100;
     trackers.forEach(tracker => {
-      score -= tracker.getScore();
+      score += tracker.getScore();
     });
     return Math.max(score, 0);

[Survived] BlockStatement
privacy-guardian/dashboard-logic.js:11:44
   }
   
   // Summarize visits to get array of privacy scores
-  export function summarizeVisits(history) {
-    const scores = [];
-    Object.values(history).forEach(visits => {
-      if (visits[0] && visits[0].privacyScore !== undefined) {
-        scores.push(visits[0].privacyScore);
-      }
-    });
-    return scores;
-  }
+  export function summarizeVisits(history) {}
   
   // Pick recommendations from given data for a site

[Survived] BlockStatement
privacy-guardian/dashboard-logic.js:13:46
   // Summarize visits to get array of privacy scores
   export function summarizeVisits(history) {
     const scores = [];
-    Object.values(history).forEach(visits => {
-      if (visits[0] && visits[0].privacyScore !== undefined) {
-        scores.push(visits[0].privacyScore);
-      }
-    });
+    Object.values(history).forEach(visits => {});
     return scores;
   }

[Survived] BlockStatement
privacy-guardian/dashboard-logic.js:14:62
   export function summarizeVisits(history) {
     const scores = [];
     Object.values(history).forEach(visits => {
-      if (visits[0] && visits[0].privacyScore !== undefined) {
-        scores.push(visits[0].privacyScore);
-      }
+      if (visits[0] && visits[0].privacyScore !== undefined) {}
     });
     return scores;

[Survived] ConditionalExpression
privacy-guardian/dashboard-logic.js:14:11
   export function summarizeVisits(history) {
     const scores = [];
     Object.values(history).forEach(visits => {
-      if (visits[0] && visits[0].privacyScore !== undefined) {
+      if (false) {
         scores.push(visits[0].privacyScore);
       }

[Survived] BlockStatement
privacy-guardian/dashboard-logic.js:22:50
   }
   
   // Pick recommendations from given data for a site
-  export function pickRecommendation(data, site) {
-    return data[site] ? [{ site, alternative: data[site] }] : [];
-  }
+  export function pickRecommendation(data, site) {}
   
   // Async helper to fetch recommendations JSON

[Survived] BlockStatement
privacy-guardian/dashboard-logic.js:27:57
   }
   
   // Async helper to fetch recommendations JSON
-  export async function getRecommendationsForSite(site) {
-    const res = await fetch('recommendations.json');
-    const data = await res.json();
-    return pickRecommendation(data, site);
-  }
+  export async function getRecommendationsForSite(site) {}
   
